<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"912bb79b94d2d3c57867b84d25b0655eee41cd374a0690c5ec4424148a14df77","plan_job_ref":"Job Test plan target and replace #422 at https://github.com/dflook/terraform-github-actions/actions/runs/9274433193","plan_out_hash":"98fa21f06e38e45083510917da9a41780f183c3c49560702c7823cd9d67bd266","plan_hash":"20f5ec7ea33cf27a0e81ebfebc3bbd6711a1f1f5db6ffb529107ef2cc48dded0","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "4SgfGYAq2W" -> (known after apply)
!~  foreach = "ibrhwsjWUF" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #422](https://github.com/dflook/terraform-github-actions/actions/runs/9274433193)